layer {
  name: "data"
  type: "CPMData"
  top: "data"
  top: "label"
  transform_param {
    stride: 8
    max_rotate_degree: 40
    crop_size_x: 368
    crop_size_y: 368
    scale_prob: 0.5
    scale_min: 0.8
    scale_max: 1.2
    target_dist: 1.171
    center_perterb_max: 0
    do_clahe: false
    visualize: true
    sigma: 7
  }
  cpmdata_param {
    source: "lmdb/MPI_alltrain"
    batch_size: 4
    backend: LMDB
  }
}

# layer {
#   name: "dummy_data"
#   type: "DummyData"
#   top: "data"
#   dummy_data_param {
#     shape {
#       dim: 1
#       dim: 4
#       dim: 368
#       dim: 368
#     }
#   }
# }
# layer {
#   name: "dummy_label"
#   type: "DummyData"
#   top: "label"
#   dummy_data_param {
#     shape {
#       dim: 1
#       dim: 30
#       dim: 46
#       dim: 46
#     }
#   }
# }

layer {
  name: "image"
  type: "Slice"
  bottom: "data"
  top: "image"
  top: "center_map"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
# layer {
#   name: "label_lower"
#   type: "Slice"
#   bottom: "label"
#   top: "label_lower"
#   top: "label_backg"
#   top: "label_1st_lower"
#   top: "label_1st_backg"
#   slice_param {
#     slice_point: 14
#     slice_point: 15
#     slice_point: 29
#     axis: 1
#   }
# }

# layer {
#   name: "silence"
#   type: "Silence"
#   bottom: "label_backg"
#   bottom: "label_1st_backg"
# }
layer {
  name: "label_lower"
  type: "Slice"
  bottom: "label"
  top: "label_lower"
  top: "label_1st_lower"
  slice_param {
    slice_point: 15
    axis: 1
  }
}

layer {
  name: "pool_center_lower"
  type: "Pooling"
  bottom: "center_map"
  top: "pool_center_lower"
  pooling_param {
    pool: AVE
    kernel_size: 9
    stride: 8
  }
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "image"
  top: "conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1_stage1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1_stage1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1_stage1"
  top: "conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2_stage1"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2_stage1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2_stage1"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "conv3_4"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_4"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_4"
  type: "ReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}
layer {
  name: "pool3_stage1"
  type: "Pooling"
  bottom: "conv3_4"
  top: "pool3_stage1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3_stage1"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3_CPM"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_3_CPM"
  type: "ReLU"
  bottom: "conv4_3_CPM"
  top: "conv4_3_CPM"
}
layer {
  name: "conv4_4_CPM"
  type: "Convolution"
  bottom: "conv4_3_CPM"
  top: "conv4_4_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_4_CPM"
  type: "ReLU"
  bottom: "conv4_4_CPM"
  top: "conv4_4_CPM"
}
layer {
  name: "conv4_5_CPM"
  type: "Convolution"
  bottom: "conv4_4_CPM"
  top: "conv4_5_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_5_CPM"
  type: "ReLU"
  bottom: "conv4_5_CPM"
  top: "conv4_5_CPM"
}
layer {
  name: "conv4_6_CPM"
  type: "Convolution"
  bottom: "conv4_5_CPM"
  top: "conv4_6_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_6_CPM"
  type: "ReLU"
  bottom: "conv4_6_CPM"
  top: "conv4_6_CPM"
}
layer {
  name: "conv4_7_CPM"
  type: "Convolution"
  bottom: "conv4_6_CPM"
  top: "conv4_7_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_7_CPM"
  type: "ReLU"
  bottom: "conv4_7_CPM"
  top: "conv4_7_CPM"
}
layer {
  name: "conv5_1_CPM"
  type: "Convolution"
  bottom: "conv4_7_CPM"
  top: "conv5_1_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_1_CPM"
  type: "ReLU"
  bottom: "conv5_1_CPM"
  top: "conv5_1_CPM"
}
layer {
  name: "conv5_2_CPM"
  type: "Convolution"
  bottom: "conv5_1_CPM"
  top: "conv5_2_CPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 15
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_stage2"
  type: "Concat"
  bottom: "conv5_2_CPM"
  bottom: "conv4_7_CPM"
  bottom: "pool_center_lower"
  top: "concat_stage2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Mconv1_stage2"
  type: "Convolution"
  bottom: "concat_stage2"
  top: "Mconv1_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Mrelu1_stage2"
  type: "ReLU"
  bottom: "Mconv1_stage2"
  top: "Mconv1_stage2"
}
layer {
  name: "Mconv2_stage2"
  type: "Convolution"
  bottom: "Mconv1_stage2"
  top: "Mconv2_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Mrelu2_stage2"
  type: "ReLU"
  bottom: "Mconv2_stage2"
  top: "Mconv2_stage2"
}
layer {
  name: "Mconv3_stage2"
  type: "Convolution"
  bottom: "Mconv2_stage2"
  top: "Mconv3_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Mrelu3_stage2"
  type: "ReLU"
  bottom: "Mconv3_stage2"
  top: "Mconv3_stage2"
}
layer {
  name: "Mconv4_stage2"
  type: "Convolution"
  bottom: "Mconv3_stage2"
  top: "Mconv4_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Mrelu4_stage2"
  type: "ReLU"
  bottom: "Mconv4_stage2"
  top: "Mconv4_stage2"
}
layer {
  name: "Mconv5_stage2"
  type: "Convolution"
  bottom: "Mconv4_stage2"
  top: "Mconv5_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Mrelu5_stage2"
  type: "ReLU"
  bottom: "Mconv5_stage2"
  top: "Mconv5_stage2"
}
layer {
  name: "Mconv6_stage2"
  type: "Convolution"
  bottom: "Mconv5_stage2"
  top: "Mconv6_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "Mrelu6_stage2"
  type: "ReLU"
  bottom: "Mconv6_stage2"
  top: "Mconv6_stage2"
}
layer {
  name: "Mconv7_stage2"
  type: "Convolution"
  bottom: "Mconv6_stage2"
  top: "Mconv7_stage2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 15
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
# layer {
#   name: "concat_stage3"
#   type: "Concat"
#   bottom: "Mconv7_stage2"
#   bottom: "conv4_7_CPM"
#   bottom: "pool_center_lower"
#   top: "concat_stage3"
#   concat_param {
#     axis: 1
#   }
# }
# layer {
#   name: "Mconv1_stage3"
#   type: "Convolution"
#   bottom: "concat_stage3"
#   top: "Mconv1_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu1_stage3"
#   type: "ReLU"
#   bottom: "Mconv1_stage3"
#   top: "Mconv1_stage3"
# }
# layer {
#   name: "Mconv2_stage3"
#   type: "Convolution"
#   bottom: "Mconv1_stage3"
#   top: "Mconv2_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu2_stage3"
#   type: "ReLU"
#   bottom: "Mconv2_stage3"
#   top: "Mconv2_stage3"
# }
# layer {
#   name: "Mconv3_stage3"
#   type: "Convolution"
#   bottom: "Mconv2_stage3"
#   top: "Mconv3_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu3_stage3"
#   type: "ReLU"
#   bottom: "Mconv3_stage3"
#   top: "Mconv3_stage3"
# }
# layer {
#   name: "Mconv4_stage3"
#   type: "Convolution"
#   bottom: "Mconv3_stage3"
#   top: "Mconv4_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu4_stage3"
#   type: "ReLU"
#   bottom: "Mconv4_stage3"
#   top: "Mconv4_stage3"
# }
# layer {
#   name: "Mconv5_stage3"
#   type: "Convolution"
#   bottom: "Mconv4_stage3"
#   top: "Mconv5_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu5_stage3"
#   type: "ReLU"
#   bottom: "Mconv5_stage3"
#   top: "Mconv5_stage3"
# }
# layer {
#   name: "Mconv6_stage3"
#   type: "Convolution"
#   bottom: "Mconv5_stage3"
#   top: "Mconv6_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu6_stage3"
#   type: "ReLU"
#   bottom: "Mconv6_stage3"
#   top: "Mconv6_stage3"
# }
# layer {
#   name: "Mconv7_stage3"
#   type: "Convolution"
#   bottom: "Mconv6_stage3"
#   top: "Mconv7_stage3"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 15
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "concat_stage4"
#   type: "Concat"
#   bottom: "Mconv7_stage3"
#   bottom: "conv4_7_CPM"
#   bottom: "pool_center_lower"
#   top: "concat_stage4"
#   concat_param {
#     axis: 1
#   }
# }
# layer {
#   name: "Mconv1_stage4"
#   type: "Convolution"
#   bottom: "concat_stage4"
#   top: "Mconv1_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu1_stage4"
#   type: "ReLU"
#   bottom: "Mconv1_stage4"
#   top: "Mconv1_stage4"
# }
# layer {
#   name: "Mconv2_stage4"
#   type: "Convolution"
#   bottom: "Mconv1_stage4"
#   top: "Mconv2_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu2_stage4"
#   type: "ReLU"
#   bottom: "Mconv2_stage4"
#   top: "Mconv2_stage4"
# }
# layer {
#   name: "Mconv3_stage4"
#   type: "Convolution"
#   bottom: "Mconv2_stage4"
#   top: "Mconv3_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu3_stage4"
#   type: "ReLU"
#   bottom: "Mconv3_stage4"
#   top: "Mconv3_stage4"
# }
# layer {
#   name: "Mconv4_stage4"
#   type: "Convolution"
#   bottom: "Mconv3_stage4"
#   top: "Mconv4_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu4_stage4"
#   type: "ReLU"
#   bottom: "Mconv4_stage4"
#   top: "Mconv4_stage4"
# }
# layer {
#   name: "Mconv5_stage4"
#   type: "Convolution"
#   bottom: "Mconv4_stage4"
#   top: "Mconv5_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu5_stage4"
#   type: "ReLU"
#   bottom: "Mconv5_stage4"
#   top: "Mconv5_stage4"
# }
# layer {
#   name: "Mconv6_stage4"
#   type: "Convolution"
#   bottom: "Mconv5_stage4"
#   top: "Mconv6_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu6_stage4"
#   type: "ReLU"
#   bottom: "Mconv6_stage4"
#   top: "Mconv6_stage4"
# }
# layer {
#   name: "Mconv7_stage4"
#   type: "Convolution"
#   bottom: "Mconv6_stage4"
#   top: "Mconv7_stage4"
#   param {
#     lr_mult: 1.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 15
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
####
# stage 5
####
# layer {
#   name: "concat_stage5"
#   type: "Concat"
#   bottom: "Mconv7_stage4"
#   bottom: "conv4_7_CPM"
#   bottom: "pool_center_lower"
#   top: "concat_stage5"
#   concat_param {
#     axis: 1
#   }
# }
# layer {
#   name: "Mconv1_stage5"
#   type: "Convolution"
#   bottom: "concat_stage5"
#   top: "Mconv1_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu1_stage5"
#   type: "ReLU"
#   bottom: "Mconv1_stage5"
#   top: "Mconv1_stage5"
# }
# layer {
#   name: "Mconv2_stage5"
#   type: "Convolution"
#   bottom: "Mconv1_stage5"
#   top: "Mconv2_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu2_stage5"
#   type: "ReLU"
#   bottom: "Mconv2_stage5"
#   top: "Mconv2_stage5"
# }
# layer {
#   name: "Mconv3_stage5"
#   type: "Convolution"
#   bottom: "Mconv2_stage5"
#   top: "Mconv3_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu3_stage5"
#   type: "ReLU"
#   bottom: "Mconv3_stage5"
#   top: "Mconv3_stage5"
# }
# layer {
#   name: "Mconv4_stage5"
#   type: "Convolution"
#   bottom: "Mconv3_stage5"
#   top: "Mconv4_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu4_stage5"
#   type: "ReLU"
#   bottom: "Mconv4_stage5"
#   top: "Mconv4_stage5"
# }
# layer {
#   name: "Mconv5_stage5"
#   type: "Convolution"
#   bottom: "Mconv4_stage5"
#   top: "Mconv5_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu5_stage5"
#   type: "ReLU"
#   bottom: "Mconv5_stage5"
#   top: "Mconv5_stage5"
# }
# layer {
#   name: "Mconv6_stage5"
#   type: "Convolution"
#   bottom: "Mconv5_stage5"
#   top: "Mconv6_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu6_stage5"
#   type: "ReLU"
#   bottom: "Mconv6_stage5"
#   top: "Mconv6_stage5"
# }
# layer {
#   name: "Mconv7_stage5"
#   type: "Convolution"
#   bottom: "Mconv6_stage5"
#   top: "Mconv7_stage5"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 15
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
#####
# stage 6
#####
# layer {
#   name: "concat_stage6"
#   type: "Concat"
#   bottom: "Mconv7_stage5"
#   bottom: "conv4_7_CPM"
#   bottom: "pool_center_lower"
#   top: "concat_stage6"
#   concat_param {
#     axis: 1
#   }
# }
# layer {
#   name: "Mconv1_stage6"
#   type: "Convolution"
#   bottom: "concat_stage6"
#   top: "Mconv1_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu1_stage6"
#   type: "ReLU"
#   bottom: "Mconv1_stage6"
#   top: "Mconv1_stage6"
# }
# layer {
#   name: "Mconv2_stage6"
#   type: "Convolution"
#   bottom: "Mconv1_stage6"
#   top: "Mconv2_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu2_stage6"
#   type: "ReLU"
#   bottom: "Mconv2_stage6"
#   top: "Mconv2_stage6"
# }
# layer {
#   name: "Mconv3_stage6"
#   type: "Convolution"
#   bottom: "Mconv2_stage6"
#   top: "Mconv3_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu3_stage6"
#   type: "ReLU"
#   bottom: "Mconv3_stage6"
#   top: "Mconv3_stage6"
# }
# layer {
#   name: "Mconv4_stage6"
#   type: "Convolution"
#   bottom: "Mconv3_stage6"
#   top: "Mconv4_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu4_stage6"
#   type: "ReLU"
#   bottom: "Mconv4_stage6"
#   top: "Mconv4_stage6"
# }
# layer {
#   name: "Mconv5_stage6"
#   type: "Convolution"
#   bottom: "Mconv4_stage6"
#   top: "Mconv5_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 3
#     kernel_size: 7
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu5_stage6"
#   type: "ReLU"
#   bottom: "Mconv5_stage6"
#   top: "Mconv5_stage6"
# }
# layer {
#   name: "Mconv6_stage6"
#   type: "Convolution"
#   bottom: "Mconv5_stage6"
#   top: "Mconv6_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 128
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }
# layer {
#   name: "Mrelu6_stage6"
#   type: "ReLU"
#   bottom: "Mconv6_stage6"
#   top: "Mconv6_stage6"
# }
# layer {
#   name: "Mconv7_stage6"
#   type: "Convolution"
#   bottom: "Mconv6_stage6"
#   top: "Mconv7_stage6"
#   param {
#     lr_mult: 4.0
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 8.0
#     decay_mult: 0
#   }
#   convolution_param {
#     num_output: 15
#     pad: 0
#     kernel_size: 1
#     weight_filler {
#       type: "gaussian"
#       std: 0.01
#     }
#     bias_filler {
#       type: "constant"
#     }
#   }
# }




## loss
layer {
  name: "loss_stage1"
  type: "EuclideanLoss"
  bottom: "conv5_2_CPM"
  bottom: "label_1st_lower"
  top: "loss_stage1"
}

layer {
  name: "loss_stage2"
  type: "EuclideanLoss"
  bottom: "Mconv7_stage2"
  bottom: "label_lower"
  top: "loss_stage2"
}
# layer {
#   name: "loss_stage3"
#   type: "EuclideanLoss"
#   bottom: "Mconv7_stage3"
#   bottom: "label_lower"
#   top: "loss_stage3"
# }
# layer {
#   name: "loss_stage4"
#   type: "EuclideanLoss"
#   bottom: "Mconv7_stage4"
#   bottom: "label_lower"
#   top: "loss_stage4"
# }

# layer {
#   name: "loss-heat-map"
#   type: "EuclideanSelectiveLoss"
#   euclidean_selective_loss_param {
#     neg_factor: 1
#     hard_factor: 0.7
#     hard_threshold: 0.5
#     neg_factor_without_pos: 0.05

#     # 经过resize之后，label不一定是严格0/1
#     # 这里想尝试严格0/1的
#     force_binary: true
#     binary_threshold: 0.5
#   }
#   bottom: "Mconv7_stage4"
#   bottom: "label_lower"
 
#   top: "loss_stage_4"
# }
# layer {
#   name: "loss_stage5"
#   type: "EuclideanLoss"
#   bottom: "Mconv7_stage5"
#   bottom: "label_lower"
#   top: "loss_stage5"
# }
# layer {
#   name: "loss_stage6"
#   type: "EuclideanLoss"
#   bottom: "Mconv7_stage6"
#   bottom: "label_lower"
#   top: "loss_stage6"
# }